In [1]:
# Importing pandas and numpy Libraries
import pandas as pd
import numpy as np

In [2]:
Dataframe1 =pd.DataFrame({'X': [0, 1, 1, 3, 4], 'Y':[5, 6, 8, 8, 9]})
Dataframe1

   X  Y
0  0  5
1  1  6
2  1  8
3  3  8
4  4  9

In [3]:
# replace wrong value
Dataframe1.replace({'X':1,'Y':8}, 100)

     X    Y
0    0    5
1  100    6
2  100  100
3    3  100
4    4    9

In [4]:
# tidy up (using lambda)
Dataframe1.apply(lambda v:v+10)

    X   Y
0  10  15
1  11  16
2  11  18
3  13  18
4  14  19

In [5]:
Dataframe1.apply(lambda v:v*10)

    X   Y
0   0  50
1  10  60
2  10  80
3  30  80
4  40  90

In [7]:
Dataframe1.apply(lambda col:col.sum(), axis = 0) # Column

X     9
Y    36
dtype: int64

In [9]:
Dataframe1.apply(lambda row:row.sum(), axis = 1) # row

0     5
1     7
2     9
3    11
4    13
dtype: int64

In [12]:
Dataframe1.iloc[0, 0] = np.nan
Dataframe1

     X  Y
0  NaN  5
1  1.0  6
2  1.0  8
3  3.0  8
4  4.0  9

In [13]:
Dataframe1.dropna().apply(lambda col:col.sum(), axis = 1) # dropna removes NaN value.

1     7.0
2     9.0
3    11.0
4    13.0
dtype: float64

In [15]:
Dataframe1['summing'] = Dataframe1.X + Dataframe1.Y
Dataframe1

     X  Y  summing
0  NaN  5      NaN
1  1.0  6      7.0
2  1.0  8      9.0
3  3.0  8     11.0
4  4.0  9     13.0

In [17]:
Dataframe1.summing = (Dataframe1.X + Dataframe1.Y)*2
Dataframe1

     X  Y  summing
0  NaN  5      NaN
1  1.0  6     14.0
2  1.0  8     18.0
3  3.0  8     22.0
4  4.0  9     26.0